#pragma warning( push )
#include "../warnings_ntifs_wdm.h"
#include <ntifs.h>
#include <ntstrsafe.h>
#pragma warning( pop )


#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>

#include "inc/acpi.h"
#include "inc/nt.h"
#include "inc/win.h"
//#include "../MemIoShared.h" // included in memoryIo.h
#include "../CfgShared.h"
#include "../print.h"
#include "helper/deviceIo.h"
#include "helper/Converter.h"
#include "helper/Args.h"
#include "../common/kfileio.h"
#include "helper/filesW.h"
#include "helper/fileio.h"
//#include "helper/virtmem.h"


#define CACHE_TYPE (MmNonCached)

// maximum bar size to include into cfg log
// binaries will be written nonetheless
#define MAX_BAR_SIZE_TO_LOG 0x100

#include "../inc/pci/pci.h"
#include "../inc/pci/pciDeviceCfg-pch300series.h"
#include "../common/strings.h"
#include "../pci/pciids.h"
#include "memoryIo.h"

#include "listPciReg.h"
#include "bars.h"

#include "../common/log.h"
#include "log/logCapabilities.h"
#include "log/logCfg.h"
#include "log/logBar.h"


#define APP_NAME "CfgIO"
#define BIN_NAME APP_NAME ".exe"
#define APP_VS "1.1.2"
#define APP_LC "15.07.2026"

#define DEF_LOG_DIR_A "C:\\logs"
//#define DEF_LOG_FILE_TYPE L".log"

#define PCI_CONFIG_SIZE (0x100)
#define PCIE_CONFIG_SIZE (0x1000)

#define NO_OFFSET ((ULONG)-1)

#define MODE_READ_CFG       (0x1)
#define MODE_WRITE_CFG      (0x2)
#define MODE_DUMP_CFG       (0x3)
#define MODE_LIST_PCI_REG   (0x4)
#define MODE_LIST_PCI_IO    (0x5)
#define MODE_DUMP_PCI       (0x6)
// ...
#define MODE_MAX            (0xf)

#define LIST_TYPE_REG       (0x0)
#define LIST_TYPE_IO        (0x1)
#define LIST_TYPE_MAX       (0x2)

#define MODE_PCI_IO_MIN MODE_READ_CFG
#define MODE_PCI_IO_MAX MODE_DUMP_PCI

//#pragma pack(1)

typedef struct _PCI_IO {
    UINT64 PciExBarAddress; // 00
    UINT64 PciExBarSize; // 08
    BDF BDF; // 10
    UINT16 Offset; // 16
    ULONG Size; // 18
    PCI_READ_IN_FLAGS Flags; // 2C
    PUINT8 Data; // 30
    UINT32 Rcbo; // 38
    UINT16 BarId; // 3C
} PCI_IO, *PPCI_IO; // 3E

typedef struct _FLAGS {
    UINT32 Verbose:1;
    UINT32 PrintPlain:1;
    UINT32 Print:1;
    UINT32 WriteToFile:1;
    UINT32 Mode:4;
    UINT32 Reserved:24;
} FLAGS, *PFLAGS;

typedef struct _CMD_PARAMS {
    PWCHAR LogDir; // 00
    ULONG LogDirCb; // 08
    FLAGS Flags; // 0C
    ULONG OutBufferSize; // 10
    PCI_IO PciIo; // 14
} CMD_PARAMS, *PCMD_PARAMS; // 52

//#pragma pack()

#include "cfg.h"
#include "listPciIo.h"

INT printPciConfig(_In_ PVOID CfgBuffer, _In_ ULONG CfgBufferSize);

VOID printLPciEntryList(
    _In_ PVOID OutputBuffer, 
    _In_ ULONG Size
);

VOID printCfgDataList(
    _In_ PVOID Buffer, 
    _In_ ULONG Size,
    _In_ ULONG Count
);

NTSTATUS dumpPci(
    _In_ HANDLE Device,
    _In_ PCMD_PARAMS Params
);

INT dumpPciConfig(
    _In_ HANDLE Device, 
    _In_ PPCI_IO PciIoParams,
    _In_ PWCHAR LogDir,
    _In_ UINT32 LogDirCb,
    _In_ FLAGS Flags
);

INT readPciConfig32(
    _In_ HANDLE Device, 
    _In_ PPCI_IO PciIoParams
);

INT writePciConfig32(
    _In_ HANDLE Device, 
    _In_ PPCI_IO PciIoParams
);



int parseParams(
    int argc, 
    char** argv, 
    PCMD_PARAMS Params,
    int start_i
);

int checkParams(
    PCMD_PARAMS Params
);

void printParams(
    PCMD_PARAMS Params
);

void printUsage();

void printHelp();



